/*
The MIT License (MIT)
Copyright (c) 2015 synchrocom-proto.com

Данная лицензия разрешает лицам, получившим копию данного программного обеспечения
и сопутствующей документации (в дальнейшем именуемыми «Программное Обеспечение»), 
безвозмездно использовать Программное Обеспечение без ограничений, включая 
неограниченное право на использование, копирование, изменение, добавление, 
публикацию, распространение, сублицензирование и/или продажу копий Программного 
Обеспечения, а также лицам, которым предоставляется данное Программное Обеспечение, 
при соблюдении следующих условий: 

Кроме содержимого в этом уведомлении, имя (имена) вышеуказанных держателей авторских
прав не должно быть использовано в рекламе или иным способом, чтобы увеличивать 
продажу, использование или другие работы в этом Программном обеспечении без 
предшествующего письменного разрешения.

Указанное выше уведомление об авторском праве и данные условия должны быть включены
во все копии или значимые части данного Программного Обеспечения.


ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, 
ЯВНО ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ, 
СООТВЕТСТВИЯ ПО ЕГО КОНКРЕТНОМУ НАЗНАЧЕНИЮ И ОТСУТСТВИЯ НАРУШЕНИЙ, НО НЕ 
ОГРАНИЧИВАЯСЬ ИМИ. НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ 
ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО ИСКАМ, ЗА УЩЕРБ ИЛИ ПО ИНЫМ ТРЕБОВАНИЯМ, В ТОМ 
ЧИСЛЕ, ПРИ ДЕЙСТВИИ КОНТРАКТА, ДЕЛИКТЕ ИЛИ ИНОЙ СИТУАЦИИ, ВОЗНИКШИМ ИЗ-ЗА 
ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ИНЫХ ДЕЙСТВИЙ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
*/

package synchrocom.sca;


/**
 *
 * @author Synchrocom
 */
public class SCAUtil {
    int base = 255;
    /**
     * Интервал адресов подчиненных узлов
     */
    public static final byte SLAVE_HOST_ADDRESS_MIN = 1 - Byte.MAX_VALUE - 1;
    public static final byte SLAVE_HOST_ADDRESS_MAX = 239 - Byte.MAX_VALUE - 1;
    
    /**
     * Активный синхронизирующий узел
     */
    public static final byte MASTER_SYNC_HOST_ADDRESS = 240 - Byte.MAX_VALUE - 1;
    
    /**
     * Интервал адресов синхронизирующих узлов узлов
     */
    public static final byte SYNC_HOST_ADDRESS_MIN = 241 - Byte.MAX_VALUE - 1;
    public static final byte SYNC_HOST_ADDRESS_MAX = 250 - Byte.MAX_VALUE - 1;
    
    /**
     * Псевдоузел (используется для передачи сообщений самому себе)
     */
    public static final byte PSEUDO_HOST_ADDRESS = 251 - Byte.MAX_VALUE - 1;
    
    /**
     * Псевдоузел (используется для передачи сообщений самому себе)
     */
    public static final byte EMPTY_HOST_ADDRESS = 252 - Byte.MAX_VALUE - 1;
    
    /**
     * Технологический узел (используется для настройки и диагностики остальных узлов)
     */
    public static final byte TECH_HOST_ADDRESS = 253 - Byte.MAX_VALUE - 1;
    
    /**
     * Роутер для выхода в сеть Ethernet
     */
    public static final byte GW_HOST_ADDRESS = 254 - Byte.MAX_VALUE - 1;
    
    /**
     * Роутер для выхода в сеть Ethernet
     */
    public static final byte BROADCAST_HOST_ADDRESS = 255 - Byte.MAX_VALUE - 1;
    
    public static int getCurrentTime() {
        return (int) (System.currentTimeMillis() - Long.MAX_VALUE/2);
    }
}
